english/newwords/LifeAndDeathInShangHai.org
#+OPTIONS: ^:{} _:{} num:t toc:t \n:t
#+SETUPFILE: "../../layout/extension.org"
#+INCLUDE: "../../layout/template-toc.org"
#+title:上海生死劫

* decree
  n 命令，法令order given by a ruler or an authority and having the force of a law
  v 发布命令
  #+BEGIN_EXAMPLE
  The Party did not decree how the people should live.
  #+END_EXAMPLE
* lest
  for fear that 恐怕，以免
  #+BEGIN_EXAMPLE
  We were forbidden to discharge our domestic staff lest we aggravate the unempolyment problem.
  #+END_EXAMPLE
* convulse/render
  convulse
  （情绪、笑或物理刺激）使（无法控制地）剧烈抖动 
  (喻)使（国家）陷入剧烈的社会（或政治）动荡
  render
  给予，提供服务；使成为，使得
  #+BEGIN_EXAMPLE
  But the political campaigns that periodically convulsed the country rendered many formerly wealthy people poor.
  #+END_EXAMPLE
* circumspect
  cautious, wary 谨慎的，小心的
  circumspection
  #+BEGIN_EXAMPLE
  However, my daughter and I lived quietly, with circumspection.
  #+END_EXAMPLE
* vehement/denunciation
  vehement
  adj 感情强烈的
  vehemence
  denunciation
  n 谴责
* have a premonition
  有（不详）预感
  #+BEGIN_EXAMPLE
  I had no premonition of impending personal disaster.
  #+END_EXAMPLE
* in one's capacity as sth
  以某种身份
  #+BEGIN_EXAMPLE
  I worked in that capacity until 1966.
  #+END_EXAMPLE
* world renown
  世界有名的
* dossier
  档案
  #+BEGIN_EXAMPLE
  A refusal would go into the personal dossier that the police kept on everyone.
  #+END_EXAMPLE
* conciliatory
  adj 可看抚慰或调解的
  conciliate v安抚，使某人息怒
  #+BEGIN_EXAMPLE
  He had seemed a nice man: reasonable and conciliatory.
  conciliate outraged customers.
  #+END_EXAMPLE
* composure
  n 镇静
  #+BEGIN_EXAMPLE
  I waked slowly, deliberately creating the impression of composure.
  #+END_EXAMPLE
* exasperation
  激怒
  exasperate
  #+BEGIN_EXAMPLE
  In a tone of exasperation, he added, "Don't you know the Great Proletarian Cultural Revolution has started?"
  #+END_EXAMPLE
* apprehension
  担心，忧虑
  #+BEGIN_EXAMPLE
  The apprehension of my servants was completely understandable.
  #+END_EXAMPLE
* commensurate
  adj成比例的
  #+BEGIN_EXAMPLE
  What was not mentioned was that they would not be given jobs commensurate with their former positions in Shell but would be employed as clerks or translators at a low rate of pay with much reduced retirement pensions.
  #+END_EXAMPLE
* anomalous
  异常的，例外的
  anomaly n异常的事物
* perspiration
  n 出汗
  perspire v
* helmsman
  舵手
* proletarian
  无产者
  proletariat
  无产阶级
* hindrance
  阻碍
  hinder v 
* swagger/insolence
  swagger
  趾高气昂地行事（贬义）
  insolence
  insolent adj无礼的，傲慢的
  #+BEGIN_EXAMPLE
  The foreigners and the few Chinese who forgot their national identiy and worked with them swaggered around with insolence.
  #+END_EXAMPLE
* downright/reactionary
  downright adj 十分的
  reactionary n 反动的人 a person who is opposed to political or social change
  #+BEGIN_EXAMPLE
  But we must also recognize the fact that some of them are downright reactionaries.
  #+END_EXAMPLE
* diametrically
  完全地
  diametric n直径
  diametrical 直径的
  #+BEGIN_EXAMPLE
  Capitalism and socialism are like fire and water. They are diametrically opposed.
  #+END_EXAMPLE
* single
  v choose someone or something from a group for special treatment
  #+BEGIN_EXAMPLE
  I could not understand why he had now been singled out for criticism.
  #+END_EXAMPLE
