english/newwords/LifeAndDeathInShangHai.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="zh-CN" xml:lang="zh-CN">
<head>
<title>上海生死劫</title>
<!-- 2014-10-06 Mon 19:18 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="generator" content="Org-mode"/>
<meta name="author" content="visayafan"/>
</head>
<body>
<div id="content">
<h1 class="title">上海生死劫</h1>
<div id="table-of-contents">
<h2>&#30446;&#24405;</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. decree</a></li>
<li><a href="#sec-2">2. lest</a></li>
<li><a href="#sec-3">3. convulse/render</a></li>
<li><a href="#sec-4">4. circumspect</a></li>
<li><a href="#sec-5">5. vehement/denunciation</a></li>
<li><a href="#sec-6">6. have a premonition</a></li>
<li><a href="#sec-7">7. in one's capacity as sth</a></li>
<li><a href="#sec-8">8. world renown</a></li>
<li><a href="#sec-9">9. dossier</a></li>
<li><a href="#sec-10">10. conciliatory</a></li>
<li><a href="#sec-11">11. composure</a></li>
<li><a href="#sec-12">12. exasperation</a></li>
<li><a href="#sec-13">13. apprehension</a></li>
<li><a href="#sec-14">14. commensurate</a></li>
<li><a href="#sec-15">15. anomalous</a></li>
<li><a href="#sec-16">16. perspiration</a></li>
<li><a href="#sec-17">17. helmsman</a></li>
<li><a href="#sec-18">18. proletarian</a></li>
<li><a href="#sec-19">19. hindrance</a></li>
<li><a href="#sec-20">20. swagger/insolence</a></li>
<li><a href="#sec-21">21. downright/reactionary</a></li>
<li><a href="#sec-22">22. diametrically</a></li>
<li><a href="#sec-23">23. single</a></li>
<li><a href="#sec-24">24. stifle</a></li>
<li><a href="#sec-25">25. respite</a></li>
<li><a href="#sec-26">26. exalt</a></li>
<li><a href="#sec-27">27. denounce/errant</a></li>
<li><a href="#sec-28">28. decadent</a></li>
<li><a href="#sec-29">29. frown</a></li>
<li><a href="#sec-30">30. adjourn</a></li>
<li><a href="#sec-31">31. assume</a></li>
<li><a href="#sec-32">32. subservience/snicker</a></li>
<li><a href="#sec-33">33. disentangle</a></li>
<li><a href="#sec-34">34. devoid of sth</a></li>
<li><a href="#sec-35">35. repent</a></li>
<li><a href="#sec-36">36. depravity/ingratitude</a></li>
<li><a href="#sec-37">37. have a fit/disheveled</a></li>
<li><a href="#sec-38">38. disillusioned</a></li>
<li><a href="#sec-39">39. premises</a></li>
<li><a href="#sec-40">40. lenient</a></li>
<li><a href="#sec-41">41. standstill</a></li>
<li><a href="#sec-42">42. carnation</a></li>
<li><a href="#sec-43">43. mandarin fish</a></li>
<li><a href="#sec-44">44. take the initiative</a></li>
<li><a href="#sec-45">45. instill</a></li>
<li><a href="#sec-46">46. commendable</a></li>
<li><a href="#sec-47">47. tranquility</a></li>
<li><a href="#sec-48">48. insinuate</a></li>
<li><a href="#sec-49">49. unbeknownst</a></li>
<li><a href="#sec-50">50. apparatus</a></li>
<li><a href="#sec-51">51. emphatically</a></li>
<li><a href="#sec-52">52. turmoil</a></li>
<li><a href="#sec-53">53. obsequious</a></li>
<li><a href="#sec-54">54. accede</a></li>
<li><a href="#sec-55">55. pretext</a></li>
<li><a href="#sec-56">56. pay homage to</a></li>
<li><a href="#sec-57">57. alacrity</a></li>
<li><a href="#sec-58">58. prostrate</a></li>
<li><a href="#sec-59">59. wanto</a></li>
<li><a href="#sec-60">60. savage</a></li>
<li><a href="#sec-61">61. totalitarian</a></li>
<li><a href="#sec-62">62. chrysanthemum</a></li>
<li><a href="#sec-63">63. jasmine</a></li>
<li><a href="#sec-64">64. mediocre</a></li>
<li><a href="#sec-65">65. ovation</a></li>
<li><a href="#sec-66">66. senile dementia</a></li>
<li><a href="#sec-67">67. repose</a></li>
<li><a href="#sec-68">68. taboo/velvet/cosmetic/</a></li>
<li><a href="#sec-69">69. astronomical</a></li>
<li><a href="#sec-70">70. sever</a></li>
<li><a href="#sec-71">71. loot</a></li>
<li><a href="#sec-72">72. implicate</a></li>
<li><a href="#sec-73">73. futile</a></li>
<li><a href="#sec-74">74. preclude</a></li>
<li><a href="#sec-75">75. coin/biding</a></li>
<li><a href="#sec-76">76. down</a></li>
<li><a href="#sec-77">77. nominal</a></li>
<li><a href="#sec-78">78. by no stretch of the imagination</a></li>
<li><a href="#sec-79">79. innocuous</a></li>
<li><a href="#sec-80">80. outcast</a></li>
<li><a href="#sec-81">81. tempo</a></li>
<li><a href="#sec-82">82. mobilize</a></li>
<li><a href="#sec-83">83. topple</a></li>
<li><a href="#sec-84">84. interject</a></li>
<li><a href="#sec-85">85. come clean</a></li>
<li><a href="#sec-86">86. deflate</a></li>
<li><a href="#sec-87">87. incarcerate</a></li>
<li><a href="#sec-88">88. resign</a></li>
<li><a href="#sec-89">89. makeshift</a></li>
<li><a href="#sec-90">90. inadvertently</a></li>
<li><a href="#sec-91">91. weather</a></li>
<li><a href="#sec-92">92. vie</a></li>
<li><a href="#sec-93">93. novice</a></li>
<li><a href="#sec-94">94. philosophical</a></li>
<li><a href="#sec-95">95. repudiate</a></li>
<li><a href="#sec-96">96. gloat</a></li>
<li><a href="#sec-97">97. meddle</a></li>
<li><a href="#sec-98">98. impregnable</a></li>
</ul>
</div>
</div>
<link rel="stylesheet" type="text/css" href="../../layout/css/bootstrap_old.css" />
<link rel="stylesheet" type="text/css" href="../../layout/css/too_many_toc.css" />
<script src="../../layout/js/jquery_1.7.1.js"></script>
<script src="../../layout/js/bootstrap_old.js"></script>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> decree</h2>
<div class="outline-text-2" id="text-1">
<p>
n 命令，法令order given by a ruler or an authority and having the force of a law<br/>
v 发布命令<br/>
</p>
<pre class="example">
The Party did not decree how the people should live.
</pre>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> lest</h2>
<div class="outline-text-2" id="text-2">
<p>
for fear that 恐怕，以免<br/>
</p>
<pre class="example">
We were forbidden to discharge our domestic staff lest we aggravate the unempolyment problem.
</pre>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> convulse/render</h2>
<div class="outline-text-2" id="text-3">
<p>
convulse<br/>
（情绪、笑或物理刺激）使（无法控制地）剧烈抖动<br/>
(喻)使（国家）陷入剧烈的社会（或政治）动荡<br/>
render<br/>
给予，提供服务；使成为，使得<br/>
</p>
<pre class="example">
But the political campaigns that periodically convulsed the country rendered many formerly wealthy people poor.
</pre>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> circumspect</h2>
<div class="outline-text-2" id="text-4">
<p>
cautious, wary 谨慎的，小心的<br/>
circumspection<br/>
</p>
<pre class="example">
However, my daughter and I lived quietly, with circumspection.
</pre>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> vehement/denunciation</h2>
<div class="outline-text-2" id="text-5">
<p>
vehement<br/>
adj 感情强烈的<br/>
vehemence<br/>
denunciation<br/>
n 谴责<br/>
</p>
</div>
</div>

<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> have a premonition</h2>
<div class="outline-text-2" id="text-6">
<p>
有（不详）预感<br/>
</p>
<pre class="example">
I had no premonition of impending personal disaster.
</pre>
</div>
</div>

<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> in one's capacity as sth</h2>
<div class="outline-text-2" id="text-7">
<p>
以某种身份<br/>
</p>
<pre class="example">
I worked in that capacity until 1966.
</pre>
</div>
</div>

<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> world renown</h2>
<div class="outline-text-2" id="text-8">
<p>
世界有名的<br/>
</p>
</div>
</div>

<div id="outline-container-sec-9" class="outline-2">
<h2 id="sec-9"><span class="section-number-2">9</span> dossier</h2>
<div class="outline-text-2" id="text-9">
<p>
档案<br/>
</p>
<pre class="example">
A refusal would go into the personal dossier that the police kept on everyone.
</pre>
</div>
</div>

<div id="outline-container-sec-10" class="outline-2">
<h2 id="sec-10"><span class="section-number-2">10</span> conciliatory</h2>
<div class="outline-text-2" id="text-10">
<p>
adj 可看抚慰或调解的<br/>
conciliate v安抚，使某人息怒<br/>
</p>
<pre class="example">
He had seemed a nice man: reasonable and conciliatory.
conciliate outraged customers.
</pre>
</div>
</div>

<div id="outline-container-sec-11" class="outline-2">
<h2 id="sec-11"><span class="section-number-2">11</span> composure</h2>
<div class="outline-text-2" id="text-11">
<p>
n 镇静<br/>
</p>
<pre class="example">
I waked slowly, deliberately creating the impression of composure.
</pre>
</div>
</div>

<div id="outline-container-sec-12" class="outline-2">
<h2 id="sec-12"><span class="section-number-2">12</span> exasperation</h2>
<div class="outline-text-2" id="text-12">
<p>
激怒<br/>
exasperate<br/>
</p>
<pre class="example">
In a tone of exasperation, he added, "Don't you know the Great Proletarian Cultural Revolution has started?"
</pre>
</div>
</div>

<div id="outline-container-sec-13" class="outline-2">
<h2 id="sec-13"><span class="section-number-2">13</span> apprehension</h2>
<div class="outline-text-2" id="text-13">
<p>
担心，忧虑<br/>
</p>
<pre class="example">
The apprehension of my servants was completely understandable.
</pre>
</div>
</div>

<div id="outline-container-sec-14" class="outline-2">
<h2 id="sec-14"><span class="section-number-2">14</span> commensurate</h2>
<div class="outline-text-2" id="text-14">
<p>
adj成比例的<br/>
</p>
<pre class="example">
What was not mentioned was that they would not be given jobs commensurate with their former positions in Shell but would be employed as clerks or translators at a low rate of pay with much reduced retirement pensions.
</pre>
</div>
</div>

<div id="outline-container-sec-15" class="outline-2">
<h2 id="sec-15"><span class="section-number-2">15</span> anomalous</h2>
<div class="outline-text-2" id="text-15">
<p>
异常的，例外的<br/>
anomaly n异常的事物<br/>
</p>
</div>
</div>

<div id="outline-container-sec-16" class="outline-2">
<h2 id="sec-16"><span class="section-number-2">16</span> perspiration</h2>
<div class="outline-text-2" id="text-16">
<p>
n 出汗<br/>
perspire v<br/>
</p>
</div>
</div>

<div id="outline-container-sec-17" class="outline-2">
<h2 id="sec-17"><span class="section-number-2">17</span> helmsman</h2>
<div class="outline-text-2" id="text-17">
<p>
舵手<br/>
</p>
</div>
</div>

<div id="outline-container-sec-18" class="outline-2">
<h2 id="sec-18"><span class="section-number-2">18</span> proletarian</h2>
<div class="outline-text-2" id="text-18">
<p>
无产者<br/>
proletariat<br/>
无产阶级<br/>
</p>
</div>
</div>

<div id="outline-container-sec-19" class="outline-2">
<h2 id="sec-19"><span class="section-number-2">19</span> hindrance</h2>
<div class="outline-text-2" id="text-19">
<p>
阻碍<br/>
hinder v<br/>
</p>
</div>
</div>

<div id="outline-container-sec-20" class="outline-2">
<h2 id="sec-20"><span class="section-number-2">20</span> swagger/insolence</h2>
<div class="outline-text-2" id="text-20">
<p>
swagger<br/>
趾高气昂地行事（贬义）<br/>
insolence<br/>
insolent adj无礼的，傲慢的<br/>
</p>
<pre class="example">
The foreigners and the few Chinese who forgot their national identiy and worked with them swaggered around with insolence.
</pre>
</div>
</div>

<div id="outline-container-sec-21" class="outline-2">
<h2 id="sec-21"><span class="section-number-2">21</span> downright/reactionary</h2>
<div class="outline-text-2" id="text-21">
<p>
downright adj 十分的<br/>
reactionary n 反动的人 a person who is opposed to political or social change<br/>
</p>
<pre class="example">
But we must also recognize the fact that some of them are downright reactionaries.
</pre>
</div>
</div>

<div id="outline-container-sec-22" class="outline-2">
<h2 id="sec-22"><span class="section-number-2">22</span> diametrically</h2>
<div class="outline-text-2" id="text-22">
<p>
完全地<br/>
diametric n直径<br/>
diametrical 直径的<br/>
</p>
<pre class="example">
Capitalism and socialism are like fire and water. They are diametrically opposed.
</pre>
</div>
</div>

<div id="outline-container-sec-23" class="outline-2">
<h2 id="sec-23"><span class="section-number-2">23</span> single</h2>
<div class="outline-text-2" id="text-23">
<p>
v choose someone or something from a group for special treatment<br/>
</p>
<pre class="example">
I could not understand why he had now been singled out for criticism.
</pre>
</div>
</div>
