english/newwords/LifeAndDeathInShangHai.org
* stifle
  v 感到窒息
  stifling adj令人窒息的，闷的
* respite
  短暂的休息
  #+BEGIN_EXAMPLE
  The people would have a few months or a few years of respite until the next political campaign.
  #+END_EXAMPLE
* exalt
  v praise
  #+BEGIN_EXAMPLE
  They exalted Mao Zedong, the Party, socialism and anything else the party wanted the people to believe in.
  #+END_EXAMPLE
* denounce/errant
  denounce v告发；谴责
  errant adj 犯错的，行为不当的，出轨的
  #+BEGIN_EXAMPLE
  These accusations did not surprise me, because I knew that when a man was denounced, he was depicted as totally bad and any errant behavior was attributed to the influence of capitalism.
  #+END_EXAMPLE
* decadent
  adj 颓废的，堕落的，放纵的
  #+BEGIN_EXAMPLE
  The man was now talking about Tao’s decadent way of life resulting from long association with capitalism.
  #+END_EXAMPLE
* frown
  皱眉；不赞成某事 frown on/upon sth
  extramarital 婚外的
  indulgence n放纵
  indulge v ~ oneself/sb with sth
  #+BEGIN_EXAMPLE
  It seemed he was guilty of having extramarital relations, drinking wine and spirits to excess, and enjoying elaborate meals, all acts of self-indulgence frowned upon by the Party.
  #+END_EXAMPLE
* adjourn
  暂停会议一段时间；使延期
  #+BEGIN_EXAMPLE
  Perhaps the speaker was also tired and hungry, for he suddenly stopped and told us the meeting was adjourned until one-thirty.
  #+END_EXAMPLE
* assume
  猜测；假装，装作
  #+BEGIN_EXAMPLE
  In Chinese mythology, “cow’s demon and snake spirit牛鬼蛇神” are evil spirits who can assume human forms to do mischief, but when recognized by real humans as devils they revert to their original shapes.
  #+END_EXAMPLE
* subservience/snicker
  subservient adj毕恭毕敬的
  snicker v/n 暗笑，偷笑
  #+BEGIN_EXAMPLE
  When Tao climbed onto the chair and stood there in a posture of subservience in his tall paper hat, the snickers became uncontrolled laughter.
  #+END_EXAMPLE
* disentangle
  ~ sth/sb from sth
  摆脱
  #+BEGIN_EXAMPLE
  I thought Tao Feng very stupid to agree that he had sold himself for money, because this admission could open the way to all sorts of more serious accusations from which he might find it difficult to disentangle himself.
  #+END_EXAMPLE
* devoid of sth
  没有
  #+BEGIN_EXAMPLE
  Tao took a few sheets of paper from his pocket and started to read a prepared statement in a low voice devoid of emotion. 
  #+END_EXAMPLE
* repent
  v feel regret
  #+BEGIN_EXAMPLE
  He begged the proletariat to forgive him and give him a chance to repent.
  #+END_EXAMPLE
  repentant adj
  repentance n
* depravity/ingratitude
  #+BEGIN_EXAMPLE
  He mentioned the fact that his son was a Party member and had been educated abroad at government expense. His own life of depravity, he said, was an act of gross ingratitude to the People’s Government. 
  #+END_EXAMPLE
* have a fit/disheveled
  have a fit = angry
  disheveled 衣服或头发不整齐
  #+BEGIN_EXAMPLE
  Your servants will have a fit if they see me coming to dinner looking so disheveled.
  #+END_EXAMPLE
* disillusioned
  ~ with sb/sth 大失所望，幻想破灭
* premises
  房屋或其它建筑
* lenient
  adj merciful
  #+BEGIN_EXAMPLE
  As a result of a more lenient policy, Henry and Winnie were given a more spacious apartment near my home.
  #+END_EXAMPLE
* standstill
  n 停顿
  treachery n背叛
  cow n牛 v恐吓某人
  #+BEGIN_EXAMPLE
  The treachery of Mao Zedong in repeatedly inviting frank and constructive criticism and then harshly punishing those who gave it completely cowed the Chinese intellectuals, so that China’s cultural life came to a virtual standstill.
  #+END_EXAMPLE
* carnation
  康乃馨
* mandarin fish
  mandarin 普通话
  mandarin fish 鲑鱼
  
* take the initiative
  带头，发起
  #+BEGIN_EXAMPLE
  I always humbly ask my Party secretary for instructions and never indulge in the luxury of taking the initiative.
  #+END_EXAMPLE
* instill
  introduce gradually 逐渐培养/灌输
  #+BEGIN_EXAMPLE
  I thought it was mainly the feeling of guilt instilled in her by Communist propaganda about the rich exploiting the poor that created in her the desire to help these children.
  #+END_EXAMPLE
* commendable
  adj 值得表扬的
  commend v 表扬
  #+BEGIN_EXAMPLE
  While I thought her activities rather commendable, Chen-ma disapproved heartily, especially when she loaned her clothes to other girls and then brought home the dirty laundry for Chen-ma to wash.
  #+END_EXAMPLE
* tranquility
  平静，安宁
  tranquil adj 平静的，安静的
  #+BEGIN_EXAMPLE
  It was a scene of domestic peace and tranquility but for an invisible threat hanging in the air
  #+END_EXAMPLE
* insinuate
  暗示
  #+BEGIN_EXAMPLE
  I don’t know much about the life of any of the denounced people, and I don’t want to lie and insinuate.
  They never went beyond insinuating that Shell had done something wrong and that I was a part of whatever the crime was.
  #+END_EXAMPLE
* unbeknownst
  unbeknown adj不为所知的
* apparatus
  仪器，装置；机关组织，机构
  contention n争论
  #+BEGIN_EXAMPLE
  The point of contention was who should conduct the Cultural Revolution: the established Party apparatus or a special committee of Maoists appointed by Mao Zedong as chairman of the Central Committee.
  #+END_EXAMPLE
* emphatically
  adv 强调地
  emphasis n
  emphasize
  #+BEGIN_EXAMPLE
  “Everything I did for Shell was in accordance with the laws and regulations of the People’s Government,” I declared emphatically.
  #+END_EXAMPLE
