english/newwords/LifeAndDeathInShangHai.html

<div id="outline-container-sec-24" class="outline-2">
<h2 id="sec-24"><span class="section-number-2">24</span> stifle</h2>
<div class="outline-text-2" id="text-24">
<p>
v 感到窒息<br/>
stifling adj令人窒息的，闷的<br/>
</p>
</div>
</div>

<div id="outline-container-sec-25" class="outline-2">
<h2 id="sec-25"><span class="section-number-2">25</span> respite</h2>
<div class="outline-text-2" id="text-25">
<p>
短暂的休息<br/>
</p>
<pre class="example">
The people would have a few months or a few years of respite until the next political campaign.
</pre>
</div>
</div>

<div id="outline-container-sec-26" class="outline-2">
<h2 id="sec-26"><span class="section-number-2">26</span> exalt</h2>
<div class="outline-text-2" id="text-26">
<p>
v praise<br/>
</p>
<pre class="example">
They exalted Mao Zedong, the Party, socialism and anything else the party wanted the people to believe in.
</pre>
</div>
</div>

<div id="outline-container-sec-27" class="outline-2">
<h2 id="sec-27"><span class="section-number-2">27</span> denounce/errant</h2>
<div class="outline-text-2" id="text-27">
<p>
denounce v告发；谴责<br/>
errant adj 犯错的，行为不当的，出轨的<br/>
</p>
<pre class="example">
These accusations did not surprise me, because I knew that when a man was denounced, he was depicted as totally bad and any errant behavior was attributed to the influence of capitalism.
</pre>
</div>
</div>

<div id="outline-container-sec-28" class="outline-2">
<h2 id="sec-28"><span class="section-number-2">28</span> decadent</h2>
<div class="outline-text-2" id="text-28">
<p>
adj 颓废的，堕落的，放纵的<br/>
</p>
<pre class="example">
The man was now talking about Tao’s decadent way of life resulting from long association with capitalism.
</pre>
</div>
</div>

<div id="outline-container-sec-29" class="outline-2">
<h2 id="sec-29"><span class="section-number-2">29</span> frown</h2>
<div class="outline-text-2" id="text-29">
<p>
皱眉；不赞成某事 frown on/upon sth<br/>
extramarital 婚外的<br/>
indulgence n放纵<br/>
indulge v ~ oneself/sb with sth<br/>
</p>
<pre class="example">
It seemed he was guilty of having extramarital relations, drinking wine and spirits to excess, and enjoying elaborate meals, all acts of self-indulgence frowned upon by the Party.
</pre>
</div>
</div>

<div id="outline-container-sec-30" class="outline-2">
<h2 id="sec-30"><span class="section-number-2">30</span> adjourn</h2>
<div class="outline-text-2" id="text-30">
<p>
暂停会议一段时间；使延期<br/>
</p>
<pre class="example">
Perhaps the speaker was also tired and hungry, for he suddenly stopped and told us the meeting was adjourned until one-thirty.
</pre>
</div>
</div>

<div id="outline-container-sec-31" class="outline-2">
<h2 id="sec-31"><span class="section-number-2">31</span> assume</h2>
<div class="outline-text-2" id="text-31">
<p>
猜测；假装，装作<br/>
</p>
<pre class="example">
In Chinese mythology, “cow’s demon and snake spirit牛鬼蛇神” are evil spirits who can assume human forms to do mischief, but when recognized by real humans as devils they revert to their original shapes.
</pre>
</div>
</div>

<div id="outline-container-sec-32" class="outline-2">
<h2 id="sec-32"><span class="section-number-2">32</span> subservience/snicker</h2>
<div class="outline-text-2" id="text-32">
<p>
subservient adj毕恭毕敬的<br/>
snicker v/n 暗笑，偷笑<br/>
</p>
<pre class="example">
When Tao climbed onto the chair and stood there in a posture of subservience in his tall paper hat, the snickers became uncontrolled laughter.
</pre>
</div>
</div>

<div id="outline-container-sec-33" class="outline-2">
<h2 id="sec-33"><span class="section-number-2">33</span> disentangle</h2>
<div class="outline-text-2" id="text-33">
<p>
~ sth/sb from sth<br/>
摆脱<br/>
</p>
<pre class="example">
I thought Tao Feng very stupid to agree that he had sold himself for money, because this admission could open the way to all sorts of more serious accusations from which he might find it difficult to disentangle himself.
</pre>
</div>
</div>

<div id="outline-container-sec-34" class="outline-2">
<h2 id="sec-34"><span class="section-number-2">34</span> devoid of sth</h2>
<div class="outline-text-2" id="text-34">
<p>
没有<br/>
</p>
<pre class="example">
Tao took a few sheets of paper from his pocket and started to read a prepared statement in a low voice devoid of emotion.
</pre>
</div>
</div>

<div id="outline-container-sec-35" class="outline-2">
<h2 id="sec-35"><span class="section-number-2">35</span> repent</h2>
<div class="outline-text-2" id="text-35">
<p>
v feel regret<br/>
</p>
<pre class="example">
He begged the proletariat to forgive him and give him a chance to repent.
</pre>
<p>
repentant adj<br/>
repentance n<br/>
</p>
</div>
</div>

<div id="outline-container-sec-36" class="outline-2">
<h2 id="sec-36"><span class="section-number-2">36</span> depravity/ingratitude</h2>
<div class="outline-text-2" id="text-36">
<pre class="example">
He mentioned the fact that his son was a Party member and had been educated abroad at government expense. His own life of depravity, he said, was an act of gross ingratitude to the People’s Government.
</pre>
</div>
</div>

<div id="outline-container-sec-37" class="outline-2">
<h2 id="sec-37"><span class="section-number-2">37</span> have a fit/disheveled</h2>
<div class="outline-text-2" id="text-37">
<p>
have a fit = angry<br/>
disheveled 衣服或头发不整齐<br/>
</p>
<pre class="example">
Your servants will have a fit if they see me coming to dinner looking so disheveled.
</pre>
</div>
</div>

<div id="outline-container-sec-38" class="outline-2">
<h2 id="sec-38"><span class="section-number-2">38</span> disillusioned</h2>
<div class="outline-text-2" id="text-38">
<p>
~ with sb/sth 大失所望，幻想破灭<br/>
</p>
</div>
</div>

<div id="outline-container-sec-39" class="outline-2">
<h2 id="sec-39"><span class="section-number-2">39</span> premises</h2>
<div class="outline-text-2" id="text-39">
<p>
房屋或其它建筑<br/>
</p>
</div>
</div>

<div id="outline-container-sec-40" class="outline-2">
<h2 id="sec-40"><span class="section-number-2">40</span> lenient</h2>
<div class="outline-text-2" id="text-40">
<p>
adj merciful<br/>
</p>
<pre class="example">
As a result of a more lenient policy, Henry and Winnie were given a more spacious apartment near my home.
</pre>
</div>
</div>

<div id="outline-container-sec-41" class="outline-2">
<h2 id="sec-41"><span class="section-number-2">41</span> standstill</h2>
<div class="outline-text-2" id="text-41">
<p>
n 停顿<br/>
treachery n背叛<br/>
cow n牛 v恐吓某人<br/>
</p>
<pre class="example">
The treachery of Mao Zedong in repeatedly inviting frank and constructive criticism and then harshly punishing those who gave it completely cowed the Chinese intellectuals, so that China’s cultural life came to a virtual standstill.
</pre>
</div>
</div>

<div id="outline-container-sec-42" class="outline-2">
<h2 id="sec-42"><span class="section-number-2">42</span> carnation</h2>
<div class="outline-text-2" id="text-42">
<p>
康乃馨<br/>
</p>
</div>
</div>

<div id="outline-container-sec-43" class="outline-2">
<h2 id="sec-43"><span class="section-number-2">43</span> mandarin fish</h2>
<div class="outline-text-2" id="text-43">
<p>
mandarin 普通话<br/>
mandarin fish 鲑鱼<br/>
</p>
</div>
</div>
<div id="outline-container-sec-44" class="outline-2">
<h2 id="sec-44"><span class="section-number-2">44</span> take the initiative</h2>
<div class="outline-text-2" id="text-44">
<p>
带头，发起<br/>
</p>
<pre class="example">
I always humbly ask my Party secretary for instructions and never indulge in the luxury of taking the initiative.
</pre>
</div>
</div>

<div id="outline-container-sec-45" class="outline-2">
<h2 id="sec-45"><span class="section-number-2">45</span> instill</h2>
<div class="outline-text-2" id="text-45">
<p>
introduce gradually 逐渐培养/灌输<br/>
</p>
<pre class="example">
I thought it was mainly the feeling of guilt instilled in her by Communist propaganda about the rich exploiting the poor that created in her the desire to help these children.
</pre>
</div>
</div>

<div id="outline-container-sec-46" class="outline-2">
<h2 id="sec-46"><span class="section-number-2">46</span> commendable</h2>
<div class="outline-text-2" id="text-46">
<p>
adj 值得表扬的<br/>
commend v 表扬<br/>
</p>
<pre class="example">
While I thought her activities rather commendable, Chen-ma disapproved heartily, especially when she loaned her clothes to other girls and then brought home the dirty laundry for Chen-ma to wash.
</pre>
</div>
</div>

<div id="outline-container-sec-47" class="outline-2">
<h2 id="sec-47"><span class="section-number-2">47</span> tranquility</h2>
<div class="outline-text-2" id="text-47">
<p>
平静，安宁<br/>
tranquil adj 平静的，安静的<br/>
</p>
<pre class="example">
It was a scene of domestic peace and tranquility but for an invisible threat hanging in the air
</pre>
</div>
</div>

<div id="outline-container-sec-48" class="outline-2">
<h2 id="sec-48"><span class="section-number-2">48</span> insinuate</h2>
<div class="outline-text-2" id="text-48">
<p>
暗示<br/>
</p>
<pre class="example">
I don’t know much about the life of any of the denounced people, and I don’t want to lie and insinuate.
They never went beyond insinuating that Shell had done something wrong and that I was a part of whatever the crime was.
</pre>
</div>
</div>

<div id="outline-container-sec-49" class="outline-2">
<h2 id="sec-49"><span class="section-number-2">49</span> unbeknownst</h2>
<div class="outline-text-2" id="text-49">
<p>
unbeknown adj不为所知的<br/>
</p>
</div>
</div>

<div id="outline-container-sec-50" class="outline-2">
<h2 id="sec-50"><span class="section-number-2">50</span> apparatus</h2>
<div class="outline-text-2" id="text-50">
<p>
仪器，装置；机关组织，机构<br/>
contention n争论<br/>
</p>
<pre class="example">
The point of contention was who should conduct the Cultural Revolution: the established Party apparatus or a special committee of Maoists appointed by Mao Zedong as chairman of the Central Committee.
</pre>
</div>
</div>

<div id="outline-container-sec-51" class="outline-2">
<h2 id="sec-51"><span class="section-number-2">51</span> emphatically</h2>
<div class="outline-text-2" id="text-51">
<p>
adv 强调地<br/>
emphasis n<br/>
emphasize<br/>
</p>
<pre class="example">
“Everything I did for Shell was in accordance with the laws and regulations of the People’s Government,” I declared emphatically.
</pre>
</div>
</div>
