english/newwords/LifeAndDeathInShangHai.org
* turmoil
  n 骚动，混乱
  rehabilitate v恢复地位/荣誉
  #+BEGIN_EXAMPLE
  Later, when the turmoil is over, the sorting out is done. Some of those wrongfully dealt with may be rehabilitated.”
  #+END_EXAMPLE
* obsequious
  逢迎的，巴结的
  #+BEGIN_EXAMPLE
  “It’s not in my nature to be obsequious. But thank you for the warning. I shall remember it,” I said.
  #+END_EXAMPLE
* accede
  ~ to 同意
  #+BEGIN_EXAMPLE
  The Shanghai authorities had no choice but to allow him to leave for Hong Kong with his two children when Beijing acceded to his family’s request.
  #+END_EXAMPLE
* pretext
  excuse 借口
  #+BEGIN_EXAMPLE
  The local Communist officials in Shanghai refused to grant Li Zhen an exit permit, using the pretext that her work with the Conservatory of Music required her to remain in Shanghai. 
  #+END_EXAMPLE
* pay homage to
  give honor to
  #+BEGIN_EXAMPLE
  In fact, she told me that she found attending meetings boring and maintained silence when she was expected to pay homage to Mao’s policies on music and education.
  #+END_EXAMPLE
* alacrity
  n 爽快
  #+BEGIN_EXAMPLE
  I was very pleased when she accepted my dinner invitation with alacrity.
  #+END_EXAMPLE
* prostrate
  v （尤指尊敬或屈从）使（自己）俯伏；使拜倒
  #+BEGIN_EXAMPLE
  When I got there I saw them prostrate on the ground in the courtyard. 
  #+END_EXAMPLE
* wanto
  adj 恣意的，恶意的
  #+BEGIN_EXAMPLE
  “Yes, yes, I mustn’t cry on Meiping’s birthday. But I was upset to see such wanton destruction.” She tucked her handkerchief away and went out of the room.
  #+END_EXAMPLE
* savage
  adj 凶猛的
  n 野蛮人
  #+BEGIN_EXAMPLE
  I hate struggle meetings. Somehow, everybody behaves like savages.
  #+END_EXAMPLE
* totalitarian
  极权主义的
  #+BEGIN_EXAMPLE
  In fact, after living in Communist China for so many years, I realized that one of the advantages enjoyed by a democratic government that allows freedom of speech is that the government knows exactly who supports it and who is against it, while a totalitarian government knows nothing of what the people really think.
  #+END_EXAMPLE
* chrysanthemum
  菊花
* jasmine
  茉莉
* mediocre
  ordinary 平庸的
  #+BEGIN_EXAMPLE
  My father used to say she was a mediocre actress in the old days. She seems to have improved.
  #+END_EXAMPLE
* ovation
  n 欢呼，掌声
  youngster 年轻人
  #+BEGIN_EXAMPLE
  He had smiled and waved as he received a thunderous ovation from the youngsters gathered below. 
  #+END_EXAMPLE
* senile dementia
  老年痴呆
  paranoia 妄想狂
  #+BEGIN_EXAMPLE
  One of the symptoms of senile dementia is suspicion, and the other is paranoia.
  #+END_EXAMPLE
* repose
  n 休息
  #+BEGIN_EXAMPLE
  Her black hair was spread on the white pillow, and her sweet young face was peaceful in repose.
  #+END_EXAMPLE
* taboo/velvet/cosmetic/
  taboo 禁忌
  velvet 天鹅绒
  cosmetic 化妆品
  #+BEGIN_EXAMPLE
  Because they did not think socialist man should sit on a sofa, all sofas became taboo. Other things, such as innerspring mattresses, silk, velvet, cosmetics, and clothes that reflected fashion trends of the West, were all tossed onto the streets to be carted away or burnt. 
  #+END_EXAMPLE
* astronomical
  adj 天文学的；极大的，庞大的
  #+BEGIN_EXAMPLE
  To keep alive, one had to resort to the black market, where prices were astronomical. 
  #+END_EXAMPLE
* sever
  v 切断
  denunciation 谴责
  denunciate v
  #+BEGIN_EXAMPLE
  It was signed by my neighbor’s two small children, who had joined in the denunciation of their father and vowed to sever their relationship with him. 
  #+END_EXAMPLE
* loot
  loot v 抢劫
  ransack v 彻底搜查；抢劫，洗劫
  #+BEGIN_EXAMPLE
  News of looting and the ransacking of private homes all over the city reached me from different sources. 
  #+END_EXAMPLE
* implicate
  ~ sb in sth 牵连
  #+BEGIN_EXAMPLE
  Not wishing to implicate them in my own difficulties, I refused.
  #+END_EXAMPLE
* futile
  adj无效的
* preclude
  ~ sb from doing sth 阻止
  #+BEGIN_EXAMPLE
  The propaganda they have absorbed precluded their having a free will of their own.
  #+END_EXAMPLE
* coin/biding
  coin v 创造新词语
  bidiing n 命令 do sb's biding
  #+BEGIN_EXAMPLE
  She was flattering the Red Guards by calling them “little revolutionary generals,” a title coined by the Maoists to encourage the Red Guards to do their bidding. 
  #+END_EXAMPLE
* down
  绒羽
  #+BEGIN_EXAMPLE
  quilts filled with down
  #+END_EXAMPLE
* nominal
  adj 名义上的；很少的
  chauffeur 受雇的司机
  #+BEGIN_EXAMPLE
  But every Chinese knew that the Party leaders lived in spacious mansions with many servants, obtained their provisions from special shops where luxury goods were made available to their households at nominal prices, and sent their children in chauffeur-driven cars to exclusive schools to be taught by specially selected teachers.
  #+END_EXAMPLE
* by no stretch of the imagination
  无论怎么想象
  #+BEGIN_EXAMPLE
  We were not equals by any stretch of the imagination.
  #+END_EXAMPLE
* innocuous
  无害的
  #+BEGIN_EXAMPLE
  It’s probably considered normal and innocuous anywhere else. But in Maoist China communicating with foreign countries other than through official channels was a crime.
  #+END_EXAMPLE
* outcast
  homeless and friendless 被抛弃的无家无亲人的人
  abiding adj permanent永久的
  abide by 遵守
  #+BEGIN_EXAMPLE
  I also had a deep and abiding love for the land of my ancestors even though, because of my class status, I had become an outcast.
  #+END_EXAMPLE
