english/newwords/LifeAndDeathInShangHai.html

<div id="outline-container-sec-52" class="outline-2">
<h2 id="sec-52"><span class="section-number-2">52</span> turmoil</h2>
<div class="outline-text-2" id="text-52">
<p>
n 骚动，混乱<br/>
rehabilitate v恢复地位/荣誉<br/>
</p>
<pre class="example">
Later, when the turmoil is over, the sorting out is done. Some of those wrongfully dealt with may be rehabilitated.”
</pre>
</div>
</div>

<div id="outline-container-sec-53" class="outline-2">
<h2 id="sec-53"><span class="section-number-2">53</span> obsequious</h2>
<div class="outline-text-2" id="text-53">
<p>
逢迎的，巴结的<br/>
</p>
<pre class="example">
“It’s not in my nature to be obsequious. But thank you for the warning. I shall remember it,” I said.
</pre>
</div>
</div>

<div id="outline-container-sec-54" class="outline-2">
<h2 id="sec-54"><span class="section-number-2">54</span> accede</h2>
<div class="outline-text-2" id="text-54">
<p>
~ to 同意<br/>
</p>
<pre class="example">
The Shanghai authorities had no choice but to allow him to leave for Hong Kong with his two children when Beijing acceded to his family’s request.
</pre>
</div>
</div>

<div id="outline-container-sec-55" class="outline-2">
<h2 id="sec-55"><span class="section-number-2">55</span> pretext</h2>
<div class="outline-text-2" id="text-55">
<p>
excuse 借口<br/>
</p>
<pre class="example">
The local Communist officials in Shanghai refused to grant Li Zhen an exit permit, using the pretext that her work with the Conservatory of Music required her to remain in Shanghai.
</pre>
</div>
</div>

<div id="outline-container-sec-56" class="outline-2">
<h2 id="sec-56"><span class="section-number-2">56</span> pay homage to</h2>
<div class="outline-text-2" id="text-56">
<p>
give honor to<br/>
</p>
<pre class="example">
In fact, she told me that she found attending meetings boring and maintained silence when she was expected to pay homage to Mao’s policies on music and education.
</pre>
</div>
</div>

<div id="outline-container-sec-57" class="outline-2">
<h2 id="sec-57"><span class="section-number-2">57</span> alacrity</h2>
<div class="outline-text-2" id="text-57">
<p>
n 爽快<br/>
</p>
<pre class="example">
I was very pleased when she accepted my dinner invitation with alacrity.
</pre>
</div>
</div>

<div id="outline-container-sec-58" class="outline-2">
<h2 id="sec-58"><span class="section-number-2">58</span> prostrate</h2>
<div class="outline-text-2" id="text-58">
<p>
v （尤指尊敬或屈从）使（自己）俯伏；使拜倒<br/>
</p>
<pre class="example">
When I got there I saw them prostrate on the ground in the courtyard.
</pre>
</div>
</div>

<div id="outline-container-sec-59" class="outline-2">
<h2 id="sec-59"><span class="section-number-2">59</span> wanto</h2>
<div class="outline-text-2" id="text-59">
<p>
adj 恣意的，恶意的<br/>
</p>
<pre class="example">
“Yes, yes, I mustn’t cry on Meiping’s birthday. But I was upset to see such wanton destruction.” She tucked her handkerchief away and went out of the room.
</pre>
</div>
</div>

<div id="outline-container-sec-60" class="outline-2">
<h2 id="sec-60"><span class="section-number-2">60</span> savage</h2>
<div class="outline-text-2" id="text-60">
<p>
adj 凶猛的<br/>
n 野蛮人<br/>
</p>
<pre class="example">
I hate struggle meetings. Somehow, everybody behaves like savages.
</pre>
</div>
</div>

<div id="outline-container-sec-61" class="outline-2">
<h2 id="sec-61"><span class="section-number-2">61</span> totalitarian</h2>
<div class="outline-text-2" id="text-61">
<p>
极权主义的<br/>
</p>
<pre class="example">
In fact, after living in Communist China for so many years, I realized that one of the advantages enjoyed by a democratic government that allows freedom of speech is that the government knows exactly who supports it and who is against it, while a totalitarian government knows nothing of what the people really think.
</pre>
</div>
</div>

<div id="outline-container-sec-62" class="outline-2">
<h2 id="sec-62"><span class="section-number-2">62</span> chrysanthemum</h2>
<div class="outline-text-2" id="text-62">
<p>
菊花<br/>
</p>
</div>
</div>

<div id="outline-container-sec-63" class="outline-2">
<h2 id="sec-63"><span class="section-number-2">63</span> jasmine</h2>
<div class="outline-text-2" id="text-63">
<p>
茉莉<br/>
</p>
</div>
</div>

<div id="outline-container-sec-64" class="outline-2">
<h2 id="sec-64"><span class="section-number-2">64</span> mediocre</h2>
<div class="outline-text-2" id="text-64">
<p>
ordinary 平庸的<br/>
</p>
<pre class="example">
My father used to say she was a mediocre actress in the old days. She seems to have improved.
</pre>
</div>
</div>

<div id="outline-container-sec-65" class="outline-2">
<h2 id="sec-65"><span class="section-number-2">65</span> ovation</h2>
<div class="outline-text-2" id="text-65">
<p>
n 欢呼，掌声<br/>
youngster 年轻人<br/>
</p>
<pre class="example">
He had smiled and waved as he received a thunderous ovation from the youngsters gathered below.
</pre>
</div>
</div>

<div id="outline-container-sec-66" class="outline-2">
<h2 id="sec-66"><span class="section-number-2">66</span> senile dementia</h2>
<div class="outline-text-2" id="text-66">
<p>
老年痴呆<br/>
paranoia 妄想狂<br/>
</p>
<pre class="example">
One of the symptoms of senile dementia is suspicion, and the other is paranoia.
</pre>
</div>
</div>

<div id="outline-container-sec-67" class="outline-2">
<h2 id="sec-67"><span class="section-number-2">67</span> repose</h2>
<div class="outline-text-2" id="text-67">
<p>
n 休息<br/>
</p>
<pre class="example">
Her black hair was spread on the white pillow, and her sweet young face was peaceful in repose.
</pre>
</div>
</div>

<div id="outline-container-sec-68" class="outline-2">
<h2 id="sec-68"><span class="section-number-2">68</span> taboo/velvet/cosmetic/</h2>
<div class="outline-text-2" id="text-68">
<p>
taboo 禁忌<br/>
velvet 天鹅绒<br/>
cosmetic 化妆品<br/>
</p>
<pre class="example">
Because they did not think socialist man should sit on a sofa, all sofas became taboo. Other things, such as innerspring mattresses, silk, velvet, cosmetics, and clothes that reflected fashion trends of the West, were all tossed onto the streets to be carted away or burnt.
</pre>
</div>
</div>

<div id="outline-container-sec-69" class="outline-2">
<h2 id="sec-69"><span class="section-number-2">69</span> astronomical</h2>
<div class="outline-text-2" id="text-69">
<p>
adj 天文学的；极大的，庞大的<br/>
</p>
<pre class="example">
To keep alive, one had to resort to the black market, where prices were astronomical.
</pre>
</div>
</div>

<div id="outline-container-sec-70" class="outline-2">
<h2 id="sec-70"><span class="section-number-2">70</span> sever</h2>
<div class="outline-text-2" id="text-70">
<p>
v 切断<br/>
denunciation 谴责<br/>
denunciate v<br/>
</p>
<pre class="example">
It was signed by my neighbor’s two small children, who had joined in the denunciation of their father and vowed to sever their relationship with him.
</pre>
</div>
</div>

<div id="outline-container-sec-71" class="outline-2">
<h2 id="sec-71"><span class="section-number-2">71</span> loot</h2>
<div class="outline-text-2" id="text-71">
<p>
loot v 抢劫<br/>
ransack v 彻底搜查；抢劫，洗劫<br/>
</p>
<pre class="example">
News of looting and the ransacking of private homes all over the city reached me from different sources.
</pre>
</div>
</div>

<div id="outline-container-sec-72" class="outline-2">
<h2 id="sec-72"><span class="section-number-2">72</span> implicate</h2>
<div class="outline-text-2" id="text-72">
<p>
~ sb in sth 牵连<br/>
</p>
<pre class="example">
Not wishing to implicate them in my own difficulties, I refused.
</pre>
</div>
</div>

<div id="outline-container-sec-73" class="outline-2">
<h2 id="sec-73"><span class="section-number-2">73</span> futile</h2>
<div class="outline-text-2" id="text-73">
<p>
adj无效的<br/>
</p>
</div>
</div>

<div id="outline-container-sec-74" class="outline-2">
<h2 id="sec-74"><span class="section-number-2">74</span> preclude</h2>
<div class="outline-text-2" id="text-74">
<p>
~ sb from doing sth 阻止<br/>
</p>
<pre class="example">
The propaganda they have absorbed precluded their having a free will of their own.
</pre>
</div>
</div>

<div id="outline-container-sec-75" class="outline-2">
<h2 id="sec-75"><span class="section-number-2">75</span> coin/biding</h2>
<div class="outline-text-2" id="text-75">
<p>
coin v 创造新词语<br/>
bidiing n 命令 do sb's biding<br/>
</p>
<pre class="example">
She was flattering the Red Guards by calling them “little revolutionary generals,” a title coined by the Maoists to encourage the Red Guards to do their bidding.
</pre>
</div>
</div>

<div id="outline-container-sec-76" class="outline-2">
<h2 id="sec-76"><span class="section-number-2">76</span> down</h2>
<div class="outline-text-2" id="text-76">
<p>
绒羽<br/>
</p>
<pre class="example">
quilts filled with down
</pre>
</div>
</div>

<div id="outline-container-sec-77" class="outline-2">
<h2 id="sec-77"><span class="section-number-2">77</span> nominal</h2>
<div class="outline-text-2" id="text-77">
<p>
adj 名义上的；很少的<br/>
chauffeur 受雇的司机<br/>
</p>
<pre class="example">
But every Chinese knew that the Party leaders lived in spacious mansions with many servants, obtained their provisions from special shops where luxury goods were made available to their households at nominal prices, and sent their children in chauffeur-driven cars to exclusive schools to be taught by specially selected teachers.
</pre>
</div>
</div>

<div id="outline-container-sec-78" class="outline-2">
<h2 id="sec-78"><span class="section-number-2">78</span> by no stretch of the imagination</h2>
<div class="outline-text-2" id="text-78">
<p>
无论怎么想象<br/>
</p>
<pre class="example">
We were not equals by any stretch of the imagination.
</pre>
</div>
</div>

<div id="outline-container-sec-79" class="outline-2">
<h2 id="sec-79"><span class="section-number-2">79</span> innocuous</h2>
<div class="outline-text-2" id="text-79">
<p>
无害的<br/>
</p>
<pre class="example">
It’s probably considered normal and innocuous anywhere else. But in Maoist China communicating with foreign countries other than through official channels was a crime.
</pre>
</div>
</div>

<div id="outline-container-sec-80" class="outline-2">
<h2 id="sec-80"><span class="section-number-2">80</span> outcast</h2>
<div class="outline-text-2" id="text-80">
<p>
homeless and friendless 被抛弃的无家无亲人的人<br/>
abiding adj permanent永久的<br/>
abide by 遵守<br/>
</p>
<pre class="example">
I also had a deep and abiding love for the land of my ancestors even though, because of my class status, I had become an outcast.
</pre>
</div>
</div>
