english/newwords/LifeAndDeathInShangHai.org
* tempo
  运动的进度
  #+BEGIN_EXAMPLE
  As the tempo of the Proletarian Cultural Revolution gathered momentum, all-night sessions of political indoctrination were often held in different organizations.
  Since a lead article in the People’s Daily was to be obeyed immediately, the tempo of the Cultural Revolution in Shanghai was sure to accelerate.
  #+END_EXAMPLE
* mobilize
  调动，动员；组织，集合资源
  steamed buns 馒头
  #+BEGIN_EXAMPLE
  The propaganda effort was supposed to create a suitable atmosphere of tension and mobilize the public.
  All the shops making steamed buns and the former White Russian bakeries, now state-owned, were mobilized to produce buns and bread for the Red Guards. 
  #+END_EXAMPLE
* topple
  倒下；打倒，推翻
  #+BEGIN_EXAMPLE
  until the Shanghai Party Secretariat and the municipal government were toppled by the Revolutionaries in January of the following year.
  #+END_EXAMPLE
* interject
  突然打断别人的话
  #+BEGIN_EXAMPLE
  “You needn’t get so excited. All the senior staff of foreign firms are spies. You are not the only one,” interjected the third man.
  #+END_EXAMPLE
* come clean
  坦白，全盘招供
  #+BEGIN_EXAMPLE
  “We are going to find the gold and weapons. If you don’t come clean, then you will be severely punished,” said their leader. “Come along! They must be somewhere in this house.”
  #+END_EXAMPLE
* deflate
  v使某人难堪
  #+BEGIN_EXAMPLE
  The Revolutionaries were greatly embarrassed by the rather unheroic appearance of their leader, who was now wiping his leg with a handkerchief, completely deflated.
  #+END_EXAMPLE
* incarcerate
  ~ sb in sth 监禁
  #+BEGIN_EXAMPLE
  In many instances, they fared worse than those incarcerated in regular prisons.
  Again, I was incarcerated in the dining room.
  #+END_EXAMPLE
* resign
  辞职；~ oneself to sth/doing sth听天由命
  #+BEGIN_EXAMPLE
  I was already resigned to a lower standard of living.
  I resigned myself to the possibility of the total destruction of my home.
  #+END_EXAMPLE
* makeshift
  临时的
  #+BEGIN_EXAMPLE
  At night, one or two of them slept on the floor outside my bedroom on a makeshift bed.
  #+END_EXAMPLE
* inadvertently
  漫不经心地，无意地
  #+BEGIN_EXAMPLE
  Being uncensored, these Red Guard publications and handbills inadvertently exposed some of the facts of the power struggle in the Party leadership and contributed to the breakdown of the myth that the Party leaders were a group of dedicated men united for a common purpose.
  #+END_EXAMPLE
* weather
  v 平安渡过危难
  #+BEGIN_EXAMPLE
  Mommy, we will weather the storm together. I still believe in the future of our country. Things will change. They can’t always be unfair like this. There are good leaders in the Party, such as Premier Zhou and many others.
  We will be brave and weather the storm together, dear Mommy
  #+END_EXAMPLE
* vie
  compete keenly with sb for sth
  #+BEGIN_EXAMPLE
  They vied with the Maoist Red Guards and Revolutionaries to gain control of the situation in Shanghai.
  #+END_EXAMPLE
* novice
  beginner 新手
  #+BEGIN_EXAMPLE
  But officials of the Shanghai Party Secretariat and the municipal government were not novices of the political game. 
  #+END_EXAMPLE
* philosophical
  adj 哲学的；豁达的，处之泰然的
  #+BEGIN_EXAMPLE
  She had learned to be philosophical at a young age.
  His philosophical attitude towards the loss of his own factory and his ready acceptance of a subordinate position never ceased to amaze me.
  “I’m glad you are so philosophical,” she said, smiling for the first time since she had come home.
  In fact, she seemed quite all right and is taking everything philosophically. 
  #+END_EXAMPLE
* repudiate
  否定，驳斥
  #+BEGIN_EXAMPLE
  This was supposed to repudiate my claim that Shell was interested only in commerce.
  #+END_EXAMPLE
* gloat
  沾沾自喜
  #+BEGIN_EXAMPLE
  I could see that the men who were running the show were gloating with success.
  #+END_EXAMPLE
* meddle
  interfere
  #+BEGIN_EXAMPLE
  It is not Shell’s policy to meddle in politics.
  #+END_EXAMPLE
* impregnable
  坚不可摧的，无法征服的
  pregnable
  adj vulnerable to attack
  记忆：pregnant的女人非常pregnable
  #+BEGIN_EXAMPLE
  The propaganda on class struggle that they had absorbed, not only since the beginning of the Cultural Revolution but also since 1949 when the Communist army took over Shanghai, had already built an impregnable wall between us. It was not something I could break down in a moment.
  #+END_EXAMPLE
