english/newwords/LifeAndDeathInShangHai.html

<div id="outline-container-sec-81" class="outline-2">
<h2 id="sec-81"><span class="section-number-2">81</span> tempo</h2>
<div class="outline-text-2" id="text-81">
<p>
运动的进度<br/>
</p>
<pre class="example">
As the tempo of the Proletarian Cultural Revolution gathered momentum, all-night sessions of political indoctrination were often held in different organizations.
Since a lead article in the People’s Daily was to be obeyed immediately, the tempo of the Cultural Revolution in Shanghai was sure to accelerate.
</pre>
</div>
</div>

<div id="outline-container-sec-82" class="outline-2">
<h2 id="sec-82"><span class="section-number-2">82</span> mobilize</h2>
<div class="outline-text-2" id="text-82">
<p>
调动，动员；组织，集合资源<br/>
steamed buns 馒头<br/>
</p>
<pre class="example">
The propaganda effort was supposed to create a suitable atmosphere of tension and mobilize the public.
All the shops making steamed buns and the former White Russian bakeries, now state-owned, were mobilized to produce buns and bread for the Red Guards.
</pre>
</div>
</div>

<div id="outline-container-sec-83" class="outline-2">
<h2 id="sec-83"><span class="section-number-2">83</span> topple</h2>
<div class="outline-text-2" id="text-83">
<p>
倒下；打倒，推翻<br/>
</p>
<pre class="example">
until the Shanghai Party Secretariat and the municipal government were toppled by the Revolutionaries in January of the following year.
</pre>
</div>
</div>

<div id="outline-container-sec-84" class="outline-2">
<h2 id="sec-84"><span class="section-number-2">84</span> interject</h2>
<div class="outline-text-2" id="text-84">
<p>
突然打断别人的话<br/>
</p>
<pre class="example">
“You needn’t get so excited. All the senior staff of foreign firms are spies. You are not the only one,” interjected the third man.
</pre>
</div>
</div>

<div id="outline-container-sec-85" class="outline-2">
<h2 id="sec-85"><span class="section-number-2">85</span> come clean</h2>
<div class="outline-text-2" id="text-85">
<p>
坦白，全盘招供<br/>
</p>
<pre class="example">
“We are going to find the gold and weapons. If you don’t come clean, then you will be severely punished,” said their leader. “Come along! They must be somewhere in this house.”
</pre>
</div>
</div>

<div id="outline-container-sec-86" class="outline-2">
<h2 id="sec-86"><span class="section-number-2">86</span> deflate</h2>
<div class="outline-text-2" id="text-86">
<p>
v使某人难堪<br/>
</p>
<pre class="example">
The Revolutionaries were greatly embarrassed by the rather unheroic appearance of their leader, who was now wiping his leg with a handkerchief, completely deflated.
</pre>
</div>
</div>

<div id="outline-container-sec-87" class="outline-2">
<h2 id="sec-87"><span class="section-number-2">87</span> incarcerate</h2>
<div class="outline-text-2" id="text-87">
<p>
~ sb in sth 监禁<br/>
</p>
<pre class="example">
In many instances, they fared worse than those incarcerated in regular prisons.
Again, I was incarcerated in the dining room.
</pre>
</div>
</div>

<div id="outline-container-sec-88" class="outline-2">
<h2 id="sec-88"><span class="section-number-2">88</span> resign</h2>
<div class="outline-text-2" id="text-88">
<p>
辞职；~ oneself to sth/doing sth听天由命<br/>
</p>
<pre class="example">
I was already resigned to a lower standard of living.
I resigned myself to the possibility of the total destruction of my home.
</pre>
</div>
</div>

<div id="outline-container-sec-89" class="outline-2">
<h2 id="sec-89"><span class="section-number-2">89</span> makeshift</h2>
<div class="outline-text-2" id="text-89">
<p>
临时的<br/>
</p>
<pre class="example">
At night, one or two of them slept on the floor outside my bedroom on a makeshift bed.
</pre>
</div>
</div>

<div id="outline-container-sec-90" class="outline-2">
<h2 id="sec-90"><span class="section-number-2">90</span> inadvertently</h2>
<div class="outline-text-2" id="text-90">
<p>
漫不经心地，无意地<br/>
</p>
<pre class="example">
Being uncensored, these Red Guard publications and handbills inadvertently exposed some of the facts of the power struggle in the Party leadership and contributed to the breakdown of the myth that the Party leaders were a group of dedicated men united for a common purpose.
</pre>
</div>
</div>

<div id="outline-container-sec-91" class="outline-2">
<h2 id="sec-91"><span class="section-number-2">91</span> weather</h2>
<div class="outline-text-2" id="text-91">
<p>
v 平安渡过危难<br/>
</p>
<pre class="example">
Mommy, we will weather the storm together. I still believe in the future of our country. Things will change. They can’t always be unfair like this. There are good leaders in the Party, such as Premier Zhou and many others.
We will be brave and weather the storm together, dear Mommy
</pre>
</div>
</div>

<div id="outline-container-sec-92" class="outline-2">
<h2 id="sec-92"><span class="section-number-2">92</span> vie</h2>
<div class="outline-text-2" id="text-92">
<p>
compete keenly with sb for sth<br/>
</p>
<pre class="example">
They vied with the Maoist Red Guards and Revolutionaries to gain control of the situation in Shanghai.
</pre>
</div>
</div>

<div id="outline-container-sec-93" class="outline-2">
<h2 id="sec-93"><span class="section-number-2">93</span> novice</h2>
<div class="outline-text-2" id="text-93">
<p>
beginner 新手<br/>
</p>
<pre class="example">
But officials of the Shanghai Party Secretariat and the municipal government were not novices of the political game.
</pre>
</div>
</div>

<div id="outline-container-sec-94" class="outline-2">
<h2 id="sec-94"><span class="section-number-2">94</span> philosophical</h2>
<div class="outline-text-2" id="text-94">
<p>
adj 哲学的；豁达的，处之泰然的<br/>
</p>
<pre class="example">
She had learned to be philosophical at a young age.
His philosophical attitude towards the loss of his own factory and his ready acceptance of a subordinate position never ceased to amaze me.
“I’m glad you are so philosophical,” she said, smiling for the first time since she had come home.
In fact, she seemed quite all right and is taking everything philosophically.
</pre>
</div>
</div>

<div id="outline-container-sec-95" class="outline-2">
<h2 id="sec-95"><span class="section-number-2">95</span> repudiate</h2>
<div class="outline-text-2" id="text-95">
<p>
否定，驳斥<br/>
</p>
<pre class="example">
This was supposed to repudiate my claim that Shell was interested only in commerce.
</pre>
</div>
</div>

<div id="outline-container-sec-96" class="outline-2">
<h2 id="sec-96"><span class="section-number-2">96</span> gloat</h2>
<div class="outline-text-2" id="text-96">
<p>
沾沾自喜<br/>
</p>
<pre class="example">
I could see that the men who were running the show were gloating with success.
</pre>
</div>
</div>

<div id="outline-container-sec-97" class="outline-2">
<h2 id="sec-97"><span class="section-number-2">97</span> meddle</h2>
<div class="outline-text-2" id="text-97">
<p>
interfere<br/>
</p>
<pre class="example">
It is not Shell’s policy to meddle in politics.
</pre>
</div>
</div>

<div id="outline-container-sec-98" class="outline-2">
<h2 id="sec-98"><span class="section-number-2">98</span> impregnable</h2>
<div class="outline-text-2" id="text-98">
<p>
坚不可摧的，无法征服的<br/>
pregnable<br/>
adj vulnerable to attack<br/>
记忆：pregnant的女人非常pregnable<br/>
</p>
<pre class="example">
The propaganda on class struggle that they had absorbed, not only since the beginning of the Cultural Revolution but also since 1949 when the Communist army took over Shanghai, had already built an impregnable wall between us. It was not something I could break down in a moment.
</pre>
</div>
</div>
</div>
</body>
</html>
